ShallowGreen123/T5_P4_Epaper/examples/sd_card_test/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

#
# FATFS
#
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096

#
# Format
#
CONFIG_BOOTLOADER_LOG_COLORS=y
CONFIG_BOOTLOADER_LOG_TIMESTAMP_SOURCE_CPU_TICKS=y

#
# FreeRTOS
#
CONFIG_FREERTOS_HZ=1000
